TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-01
;------------------------------------------------------------------------------
; Автор:        Лучик, Якубов, Таджибаєв
; Дата:         11/02/2021
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				;II.МАКРОСИ
				;III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG
exCode db 0
;Рядки з прізвищами для виводу на екран
yakubov db "yakubov",10,13,'$'
luchyk db "luchyk",10,13,'$'
tajibayev db "tajibayev",10,13,'$'
				;VI. ПОЧАТОК СЕГМЕНТУ КОДУ
CODESEG
Start:
;--------------------------------- 1. Ініціалізація DS и ES---------------------------------------
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es
;----------------------------------2. Операція виводу на консоль---------------------------------
			; Завантаження числа 09h до регістру ah
			; (Функція DOS 9h - команда виводу на консоль рядка)
	mov ah,09h

    mov cx, 5 ;Завантаження числа 5 до регістру cx(Лічільник циклу)
    L1: ;Початок циклу L1
    mov dx, offset yakubov ;Завантаження адреси yakubov до регістру dx

    int 21h ;виклик функції DOS 9h

	mov dx, offset luchyk ;Завантаження адреси luchyk до регістру dx

    int 21h ;виклик функції DOS 9h

    mov dx, offset tajibayev ;Завантаження адреси tajibayev до регістру dx

    int 21h ;виклик функції DOS 9h
    loop L1 ;кінець циклу
;----------------------------------3. Операція зупинки програми, очікування натискання клавіш-----
    
	mov ah,01h
			; Завантаження числа 01h до регістру ah
			; (Функція DOS 1h - команда очікування натискання клавіші...)
	int 21h		; Виклик функції DOS 1h
			; Завантаження числа 4ch до регістру ah
			; (Функція DOS 4ch - виходу з програми)
;---------------------------------4. Вихід з програми---------------------------------------------
	mov ah,4ch
	mov al,[exCode]	; отримання коду виходу 
	int 21h		; виклик функції DOS 4ch
	end Start
  
DOS 4ch
	end Start